perf/resultado_bbox_1_load_16.txt

> perf@1.0.0 artillery /home/hugo/Desktop/Arq de Soft/Tp1/2c21-tp-1/perf
> artillery "run" "load-bbox.yaml" "-e" "black_box_1"

Started phase 0 (Load), duration: 600s @ 17:24:45(-0300) 2021-10-17
Report @ 17:24:55(-0300) 2021-10-17
Elapsed time: 10 seconds
  Scenarios launched:  159
  Scenarios completed: 145
  Requests completed:  145
  Mean response/sec: 16.03
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 145

Report @ 17:25:05(-0300) 2021-10-17
Elapsed time: 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.9
  Codes:
    200: 160

Report @ 17:25:15(-0300) 2021-10-17
Elapsed time: 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 160

Report @ 17:25:25(-0300) 2021-10-17
Elapsed time: 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 911
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:25:35(-0300) 2021-10-17
Elapsed time: 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:25:45(-0300) 2021-10-17
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:25:55(-0300) 2021-10-17
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:26:05(-0300) 2021-10-17
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:26:15(-0300) 2021-10-17
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 907
    median: 901
    p95: 901
    p99: 901.9
  Codes:
    200: 160

Report @ 17:26:25(-0300) 2021-10-17
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:26:35(-0300) 2021-10-17
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:26:45(-0300) 2021-10-17
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:26:55(-0300) 2021-10-17
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:27:05(-0300) 2021-10-17
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901.5
    p99: 902
  Codes:
    200: 160

Report @ 17:27:15(-0300) 2021-10-17
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:27:25(-0300) 2021-10-17
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:27:35(-0300) 2021-10-17
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:27:45(-0300) 2021-10-17
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:27:55(-0300) 2021-10-17
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:28:05(-0300) 2021-10-17
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 906
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:28:15(-0300) 2021-10-17
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.9
  Codes:
    200: 160

Report @ 17:28:25(-0300) 2021-10-17
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:28:35(-0300) 2021-10-17
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:28:45(-0300) 2021-10-17
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:28:55(-0300) 2021-10-17
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 160

Report @ 17:29:05(-0300) 2021-10-17
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.9
  Codes:
    200: 160

Report @ 17:29:15(-0300) 2021-10-17
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:29:25(-0300) 2021-10-17
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:29:35(-0300) 2021-10-17
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:29:45(-0300) 2021-10-17
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:29:55(-0300) 2021-10-17
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 160

Report @ 17:30:05(-0300) 2021-10-17
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:30:15(-0300) 2021-10-17
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:30:25(-0300) 2021-10-17
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:30:35(-0300) 2021-10-17
Elapsed time: 5 minutes, 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:30:45(-0300) 2021-10-17
Elapsed time: 6 minutes, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:30:55(-0300) 2021-10-17
Elapsed time: 6 minutes, 10 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:31:05(-0300) 2021-10-17
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:31:15(-0300) 2021-10-17
Elapsed time: 6 minutes, 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:31:25(-0300) 2021-10-17
Elapsed time: 6 minutes, 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:31:35(-0300) 2021-10-17
Elapsed time: 6 minutes, 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:31:45(-0300) 2021-10-17
Elapsed time: 7 minutes, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:31:55(-0300) 2021-10-17
Elapsed time: 7 minutes, 10 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:32:05(-0300) 2021-10-17
Elapsed time: 7 minutes, 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901.5
    p99: 902
  Codes:
    200: 160

Report @ 17:32:15(-0300) 2021-10-17
Elapsed time: 7 minutes, 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:32:25(-0300) 2021-10-17
Elapsed time: 7 minutes, 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:32:35(-0300) 2021-10-17
Elapsed time: 7 minutes, 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:32:45(-0300) 2021-10-17
Elapsed time: 8 minutes, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 902
    p99: 902
  Codes:
    200: 160

Report @ 17:32:55(-0300) 2021-10-17
Elapsed time: 8 minutes, 10 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:33:05(-0300) 2021-10-17
Elapsed time: 8 minutes, 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:33:15(-0300) 2021-10-17
Elapsed time: 8 minutes, 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.9
  Codes:
    200: 160

Report @ 17:33:25(-0300) 2021-10-17
Elapsed time: 8 minutes, 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 160

Report @ 17:33:35(-0300) 2021-10-17
Elapsed time: 8 minutes, 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 903
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:33:45(-0300) 2021-10-17
Elapsed time: 9 minutes, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 901
    median: 901
    p95: 901
    p99: 901
  Codes:
    200: 160

Report @ 17:33:55(-0300) 2021-10-17
Elapsed time: 9 minutes, 10 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.9
  Codes:
    200: 160

Report @ 17:34:05(-0300) 2021-10-17
Elapsed time: 9 minutes, 20 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 904
    median: 901
    p95: 901
    p99: 901.9
  Codes:
    200: 160

Report @ 17:34:15(-0300) 2021-10-17
Elapsed time: 9 minutes, 30 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:34:25(-0300) 2021-10-17
Elapsed time: 9 minutes, 40 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16.02
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Report @ 17:34:35(-0300) 2021-10-17
Elapsed time: 9 minutes, 50 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 901.9
  Codes:
    200: 160

Report @ 17:34:45(-0300) 2021-10-17
Elapsed time: 10 minutes, 0 seconds
  Scenarios launched:  160
  Scenarios completed: 160
  Requests completed:  160
  Mean response/sec: 16
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901
    p99: 902
  Codes:
    200: 160

Started phase 1 (End), duration: 10s @ 17:34:45(-0300) 2021-10-17
Report @ 17:34:55(-0300) 2021-10-17
Elapsed time: 10 minutes, 10 seconds
  Scenarios launched:  1
  Scenarios completed: 15
  Requests completed:  15
  Mean response/sec: 0.1
  Response time (msec):
    min: 900
    max: 902
    median: 901
    p95: 901.8
    p99: 902
  Codes:
    200: 15

Report @ 17:34:56(-0300) 2021-10-17
Elapsed time: 10 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 17:34:56(-0300) 2021-10-17
  Scenarios launched:  9600
  Scenarios completed: 9600
  Requests completed:  9600
  Mean response/sec: 15.73
  Response time (msec):
    min: 900
    max: 911
    median: 901
    p95: 901
    p99: 902
  Scenario counts:
    Root (/): 9600 (100%)
  Codes:
    200: 9600